[{
    "_id": "66f42ba7bb8ddc0829300572",
    "title": "Booki",
    "description": "Lors de la création de la page d'accueil de l'agence de voyage Booki, ma mission était de concevoir des interfaces web responsives en intégrant avec précision les maquettes fournies, tout en utilisant HTML et CSS. Durant cette expérience, j'ai rencontré plusieurs défis, notamment l'alignement des éléments sur différentes tailles d'écran et la gestion de la disposition en colonnes ou en grille. Pour surmonter le premier obstacle, j'ai choisi d'utiliser des pourcentages plutôt que des valeurs en pixels fixes, ce qui m'a permis de créer une mise en page plus fluide et adaptable. En parallèle, l'utilisation des media queries a été essentielle pour ajuster les styles CSS en fonction des différentes tailles d'écran, garantissant ainsi un affichage optimal sur mobile, tablette et desktop. En ce qui concerne la gestion des colonnes et des grilles, j'ai opté pour l'utilisation de Flexbox et Grid, deux outils puissants qui m'ont aidée à structurer des mises en page flexibles et harmonieuses, tout en assurant une bonne adaptabilité aux diverses résolutions d'écran. Grâce à ces solutions, j'ai pu mener à bien ce projet tout en renforçant mes compétences en design responsive.",
    "cover": "/images/booki.webp",
    "images": [
      "/images/booki.webp",
      "/images/booki_1.webp",
      "/images/booki_2.webp",
      "/images/booki_sm.webp"
    ],
    "skills": "HTML, CSS\n",
    "github": "https://github.com/unamezzora/Projet1.git",
    "color": "rose"
  },
  {
    "_id": "66f42ba7bb8ddc0829300577",
    "title": "Sophie Bluel",
    "description": "Un site portfolio d’une architecte d’intérieur Sophie Bluel",
    "cover": "/images/SB.webp",
    "images": [
      "/images/SB_ajout.webp",
      "/images/SB_login.webp",
      "/images/SB_supr.webp",
      "/images/SB.webp"
    ],
    "skills": "HTML, CSS, Java Script",
    "github": "https://github.com/unamezzora/Projet3.git",
    "color": "beige"
  },
  {
    "_id": "66f42ba9bb8ddc0829300577",
    "title": "Kasa",
    "description": "Une entreprise de location d’appartements entre particuliers",
    "cover": "/images/kasa.webp",
    "images": [
      "/images/kasa.webp",
      "/images/kasa_apropos.webp",
      "/images/kasa_card_sm.webp",
      "/images/kasa_card.webp"
    ],
    "skills": "React, Sass",
    "github": "https://github.com/unamezzora/Projet5.git",
    "color": "beige"
  },
  {
    "_id": "66f42ba7bb8ddc0589300577",
    "title": "Mon Vieux Grimoire",
    "description": "Un site de référencement et de notation de livres",
    "cover": "/images/MVG.webp",
    "images": [
      "/images/MVG.webp",
      "/images/MVG_ajout.webp",
      "/images/MVG_livre.webp",
      "/images/MVG_login.webp"
    ],
    "skills": "Node.js, Express, MongoDB",
    "github": "https://github.com/unamezzora/Projet6MVG.git",
    "color": "bleu"
  }]